{"1":{"img":"62_image_batch_2.png","text":"*president* biden? Please, no.","image_caption":"The image shows a pleading baby","bks":"* pleading indicates that a person really wants a certain outcome","intents":["the meme suggests voters do not elect Biden"]},"2":{"img":"111_image_batch_2.png","text":"joe versus the volcanic kremlin don lord of the lies \"will you shut up, man?\"","image_caption":"The image shows Joe Biden arguing with Trump","bks":"* the Kremlin is a building in Moscow used as a metonym for the Russian government\n* Trump has been accused of being affiliated with Russians\n* affiliation with Russians is seen as bad, as there is political tension between the United States and Russia\n* Joe Biden famously said to Trump during a presidential debate \"will you shut up, man?\"","intents":["the meme praises Joe Biden as a better candidate and criticizing Trump"]},"3":{"img":"167_image_batch_2.png","text":"anti-vaxxers be like‚Ä¶ hang on a sec- just collecting my facts","image_caption":"The image shows a monkey looking at another monkey's butt","bks":"* poop comes from the butt\n* comparing something to poop means that it is bad","intents":["the meme mocks anti-vaxxers"]},"4":{"img":"93_image_batch_2.png","text":"virus bingo","image_caption":"The image shows images of various Conservative leaders, some with their faces crossed out","bks":"* the people with their faces crossed out got COVID when this meme was made\n* Republicans are known for spreading doubt about COVID","intents":["the meme mocks republicans"]},"5":{"img":"153_image_batch_2.png","text":"never thought I'd die fighting irresponsibly rushed vaccines side by side with an antivaxxer what about side by side with a friend? Don't you have a kid's funeral to attend or something?","image_caption":"The first image shows a person saying \"Never thought I'd die fighting irresponsibly rushed vaccines side by side with an antivaxxer.\", The second image shows a person saying \"What about side by side with a friend?\", The third image shows the first speaker saying \"Don't you have a kid's funeral to attend or something?\"","bks":"* many early COVID vaccines were approved under emergency use authorization, leading many to believe that they were not properly tested\n* there is a stereotype that the children of anti-vaxxers are likely to die young because they are more susceptible to diseases.","intents":["the meme criticizes COVID vaccines and anti-vaxxers"]},"6":{"img":"173_image_batch_2.png","text":"anti-vaxxers keep saying dumb things like \"vaccines aren't 100% effective, so they are useless\" parachutes aren't 100% effective either, but wearing one is a damn good idea‚Ä¶","image_caption":"The meme shows a man jumping off a plane with a parachute","bks":"* ","intents":["the meme criticizes anti-vaxxers as stupid"]},"7":{"img":"9_image_batch_2.png","text":"definition of stupid: knowing the truth, seeing the truth, but still believing in TRUDEAU!","image_caption":"The meme shows the famous actor Morgan Freeman appearing to say the text","bks":"* We recall that Morgan Freeman is an actor known for saying the truth in movies\n* Since a leader’s supporters are the ones that believe them\n* Trudeau must have done something stupid to have made supporting him so stupid","intents":["the meme criticizes Justin Trudeau and Trudeau's supporters"]},"8":{"img":"33_image_batch_2.png","text":"oh, look‚Ä¶ acting like a moron is genetic","image_caption":"The meme show Justin Trudeau and Pierre Trudeau dancing in a similar manner","bks":"* Pierre Trudeau and Justin Trudeau are genetically related\n* we can reason that this thing being shared is “acting like a moron","intents":["the meme criticizes Justin Trudeau and Pierre Trudeau as stupid"]},"9":{"img":"76_image_batch_2.png","text":"after first debate with trump","image_caption":"The meme depicts Joe Biden with a confused look and soiled pants","bks":"* Since looking confused and peeing yourself are commonly used to depict weakness\n* Since Joe Biden debated Donald Trump during the 2020 Presidential Election","intents":["the meme mocks Joe Biden as weak"]},"10":{"img":"172_image_batch_2.png","text":"bill gates has a secret eugenics plan to depopulate the world through vaccines because all evil villains announce their murderous plans in ted talk presentations","image_caption":"The meme depicts Bill Gates holding a vaccine","bks":"* Since secret eugenics plans to depopulate the world through vaccines are comically evil and lack a clear motive\n* the straw man fallacy attempts to refute an argument by depicting it as radical and ridiculous\n* TED Talks, which are a series of popular talks by experts in various fields\n* evil villains try to hide their evil plans","intents":["the meme mocks conspiracy theories about Bill Gates and Vaccination are stupid"]},"11":{"img":"133_image_batch_2.png","text":"\"law and order\"","image_caption":"The meme first shows a serious-looking image of Trump, The meme shows images of various Democrats with their faces crossed out","bks":"* The text is a reference to the fact that Trump refers to himself as the \"Law and Order\" president\n* The words \"Convicted\" and \"Indicted\" are commonly used when it is determined that an individual has committed a crime","intents":["the meme praises Trump and criticizes Democrats"]},"12":{"img":"189_image_batch_2.png","text":"this is so creepy‚Ä¶also, the guy behind joe, matt trowbridge, was caught on video trying to have sex with a minor.","image_caption":"The image shows Biden dancing with a young girl","bks":"* Dancing with someone is typically seen as an act that indicates romantic attraction.\n* Pedophilia is the sexual attraction to children and is considered immoral","intents":["the meme accuses Biden of being a pedophile"]},"13":{"img":"19_image_batch_2.png","text":"I say we remove the sculpture \"the thinker\" it's offensive to all the people who don't think","image_caption":"an image of the Thinker statue","bks":"* Conservatives often accuse Democrats of \"cancel culture\" and \"political correctness\", which is the idea that people are too sensitive and easily offended and that they try to censor people or things that they disagree with","intents":["the meme mocks democrats for being overly sensitive"]},"14":{"img":"135_image_batch_2.png","text":"trump body count september 16,2020 200,770 trumps idea of winning","image_caption":"The image shows a dead body with its feet exposed, bearing a tag with Trump's campaign slogan","bks":"* Trump was the president of the United States during the COVID-19 pandemic\n* Deaths from COVID in the US were significantly higher than other developed countries","intents":["the meme attacks Trump for his COVID response"]},"15":{"img":"116_image_batch_2.png","text":"last night, trump bragged about cancelling killing racial sensitivity trainings, saying america doesn't need 'em‚Ä¶ and then refused to condemn white supremacists and told them to \"stand by.\" you can't make this stuff up, folks.","image_caption":"an image of Trump during the 2020 presidential debate","bks":"* ","intents":["the meme accuses Trump of supporting white supremacists and racism"]},"16":{"img":"142_image_batch_2.png","text":"how anti-vaxxers think vaccines are made professor I found this weird blue fluid in a jar marked toxins excellent dr evil toss it all in... the vaccine vat","image_caption":"two scientists observing a flask containing blue fluid","bks":"* Anti-vaxxers believe that vaccines contain harmful chemicals","intents":["the meme mocks anti-vaxxers for being stupid"]},"17":{"img":"30_image_batch_2.png","text":"still more coherent than joe biden","image_caption":"Ozzy Osbourne","bks":"* Biden is infamous for his gaffes\n* Biden is also accused of being senile\n* Ozzy Osbourne is a famous musician known for his drug use","intents":["the meme accuses Biden of being senile"]},"18":{"img":"136_image_batch_2.png","text":"what level of hell have we entered where our tax dollars are used to fund this vehicle equipped with a 'heat ray' & a 'sound cannon' to attack U.S. citizens on the streets of America?","image_caption":"an armored vehicle","bks":"* many protests were occurring, and the government called in police and special forces to control rioting protesters","intents":["the meme asserts that the US government is turning on it's citizens"]},"19":{"img":"87_image_batch_2.png","text":"this offends me. Tear it down!","image_caption":"a road sign that reads \"Mario Cuomo Bridge KEEP LEFT.\"","bks":"* Democrats are associated with being easily offended\n* Mario Matthew Cuomo was a Democrat politician who served as the 52nd governor of New York for three terms, from 1983 to 1994","intents":["the meme mocks Democrats for being easily offended"]},"20":{"img":"81_image_batch_2.png","text":"get in! we're making america great!","image_caption":"Trump in a car, pointing a gun at the audience","bks":"* the slogan of Trump's 2016 campaign was \"Make America Great Again.\"","intents":["the meme accuses Trump of being violent","the meme praises Trump for his policies"]},"21":{"img":"78_image_batch_2.png","text":"hong kong waves american flag to fight for freedom portland waves communist flag to fight against freedom","image_caption":"On the left, the meme shows protestors in Portland waving a USSR flag.","bks":"* Portland is a city known for being very liberal.\n* The USSR was a brutally opressive authoritarian regime.","intents":["the meme accuses Liberals of being Communists"]},"22":{"img":"114_image_batch_2.png","text":"trump said the virus would disappear he was talking about himself","image_caption":"There is the image of an angry woman on the left., there is a cat lowkey arguing back on the right.","bks":"* Trump had misinformed America about COVID.","intents":["the meme mocks Trump for his COVID response"]},"23":{"img":"106_image_batch_2.png","text":"the president did not \"catch\" coronavirus he ignored the advice of doctors, mocked the science, put himself in risky situations and once exposed he refused to self quaratine and endangered the lives of hundreds of people around him","image_caption":"The meme shows Trump sticking his tongue out and looking dumb.","bks":"* during the pandemic, COVID prevention measures included self-quarantine","intents":["the meme criticizes Trump for his COVID response"]},"24":{"img":"53_image_batch_2.png","text":"will trump ever condemn hate?! 5 minutes later‚Ä¶ I hope he dies of covid!","image_caption":"The meme shows a image of woman screaming and then smiling like a crazy person.","bks":"* most Trump critics are libearls","intents":["the meme accuses liberals of hypocrisy"]},"25":{"img":"31_image_batch_2.png","text":"putting a helmet on a head without a brain is like putting a security system on an outhouse.","image_caption":"The meme shows Justin Trudeau wearing a helmet.","bks":"* out houses have nothing valuable to protect.\n* saying someone has no brain is saying that they are stupid.","intents":["the meme insults Justin Trudeau as being stupid"]},"26":{"img":"24_image_batch_2.png","text":"get in loser we're deleting meme pages for \"hate speech\" but leaving up kiddie porn and videos of people dying","image_caption":"The meme depicts Mark Zuckerburg","bks":"* Mark Zuckerburg is the CEO of Facebook\n* Facebook moderates content posted to it by banning offensive content such as hate speech, child pornography, and graphic content\n* child pornography is universally considered evil\n* memes are generally considered harmless\n* quotation marks around a word express doubt about it\n* groups or people generally have a reason for actions that would otherwise seem contradictory\n* Conservatives has accused Facebook and other social media platforms of being biased against them in the past","intents":["the meme accuses Facebook of being biased against conservatives"]},"27":{"img":"137_image_batch_2.png","text":"can I get a fuck trump","image_caption":"The image depicts a women holding her hands up in prayer","bks":"* People pray about things they have strong feelings for","intents":["the meme insults Trump"]},"28":{"img":"65_image_batch_2.png","text":"just when you think democrat ethics, honesty, integrity, and behavior have hit rock bottom, they blast through the rock bed‚Ä¶ to a never-before-seen depth.","image_caption":"Visually, the meme depicts an underground explosion","bks":"* which is a reference to the phrase \"Hitting Rock Bottom\", used to describe when someone has reached the lowest point in their life\n* Explosives used in mining operations to break through rock\n* Since we also know that ethics, honesty, integrity, and behavior are all used to judge moral character","intents":["the meme criticizes Democrats as evil"]},"29":{"img":"155_image_batch_2.png","text":"unvaccinated body:*exists* near extinct and easily preventable diseases: ","image_caption":"guy saying it's free real estate","bks":"* Since “real estate” is a term generally used to refer to houses or other properties\n* Since it’s generally easy for someone to enter and exit a house\n* Unvaccinated people intentionally refuse protection from disease in the form of vaccines\n* Contracting disease is generally considered unpleasant and something to be avoided","intents":["the meme mocks unvaccinated people as stupid"]},"30":{"img":"46_image_batch_2.png","text":"\"the phrase black lives matter suggests racial superiority. It excludes the importance of anybody else's life.\" \"that is racism defined.\" sheriff david clarke","image_caption":"The meme also depicts a man in a cowboy hat","bks":"* we understand that it is referring to Democrats, since the commonly use the phrase \"Black Lives Matter\" in protest of police brutality\n* Sheriffs are a common authority figure and therefore considered trustworthy","intents":["the meme accuses Democrats of being racist"]}}